[
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "upper-mustang-trekking", "trekName": "Upper Mustang Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Chhortens-in-Tenge-in-Upper-Mustang.jpg", "trekDescription": "Our wonderful Upper Mustang trek starts from Jomsom after taking a scenic flight from Pokhara, leading you to the hidden Shangri-La of the ancient Buddhist kingdom of Mustang, also called Lo.  Lo used to be part of the Tibetan empire, and is therefore closely connected to Tibet.  Tibetan Buddhism is still being practiced in a very pure form and villages are built in Tibetan style, with white washed houses with firewood tucked on the roofs.Until recently you could only come to Upper Mustang with a fully organized camping trek. However, nowadays some villagers have opened up small guesthouses and you can stay in a guesthouse in each overnight place. While staying there, you are welcome to sit with them in the kitchen. In Tibetan culture, the kitchen is the center of the house, and built like a kind of living room. So there is no better way to learn a bit about the daily life than spending time in the kitchen!", "price": "1779", "tripDuration": "15", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "humla-trek", "slug2": "humla-limi-valley-trek", "trekName": "Humla Limi Valley Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Limi-Valley-trekking.jpg", "trekDescription": "Exploring the rarely traveled area in western Nepal and mystic Limi Valley is like entering back in time. Due to the isolated site, the villages are very untouched by modern development. Century old Buddhist traditions interwoven with shamanistic influences are still an important part of daily life here.", "price": "2500", "tripDuration": "18", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "dolpo-trekking", "slug2": "upper-dolpo-trek", "trekName": "Upper Dolpo to Jomsom Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Phoksundo-Lake-in-Lower-Dolpo.jpg", "trekDescription": "Upper Dolpo Trek ending at Jomsom is a long and demanding journey in high altitude area of western Nepal but shows the most beautiful and remote areas of the country. Juphal to Jomsom trek is recommended to expert trekkers who are used to trek in to great heights. This trek crosses more than eleven mountain passes, seven of them higher than 5,000 m. Thus this is a difficult route compensated however by the beauty of the countryside and kindness of the people. This trekking tour is undoubtly one of the best that can be carried out in the whole of the Himalayas.", "price": "3500", "tripDuration": "24", "tripDifficulty": "Challenging "},
{"slug0": "nepal-trekking", "slug1": "dolpo-trekking", "slug2": "lower-dolpo-circuit-trek", "trekName": "Lower Dolpo Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/A-village-in-lower-Dolpo.jpg", "trekDescription": "Lower Dolpo Circuit Trek is sum of exceptional trekking experience in the remote western region of Nepal. The 18-day trek starts with a stunning flight to Jhupal via Nepalgunj and begins our trek through remote locations admiring the beautiful rain shadow landscape of the Himalayas, reflected in the colorful barren slopes of the mountains where the play of light and shadow is a perpetual fascinating spectacle. Thanks to Eric Valli, a French geographical photographer working for National Geographic, the Dolpo region of Nepal has been shown in all its integrity and full mystical experience. Furthermore, this is also one of the few areas where the pre-Buddhist Bon Po religion is still practiced. While on the trek, we get to muse at the yak caravans that maintain the traditional salt trade with Tibet. We also cross two high passes- Numa La and Baga La-and reflect on life amidst the tranquil waters of Phoksundo Lake.", "price": "2325", "tripDuration": "18", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "kanchenjunga-trekking", "slug2": "kanchenjunga-north-base-camp-trek", "trekName": "Kanchenjunga North Base Camp Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Kanchenjunga-Trekking.jpg", "trekDescription": "Kanchenjunga Trek to north base camp of the world third tallest peak (8586) lies to Nepal’s eastern part bordering to Sikkim is one of the untrodden area with impressive beauty of the Himalayas which is rare to find somewhere else in the world. The great diversity of ethnic groups, isolation, flora and fauna and some of the most stunning view of the Kanchenjunga trekking makes special with worth exploring.", "price": "1695", "tripDuration": "17", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "nepal-festival-tours-and-treks", "slug2": "mani-rimdu-festival-trekking", "trekName": "Mani Rimdu Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/monks-performing-fire-puja-in-mani-rimdu-festival.jpg", "trekDescription": "Mani Rimdu Festival is celebrated at Tengboche, Thame and Chiwong Monasteries of Solukhumbu Nepal. This is a sacred ceremonies and series of events of empowerment. It is a sequence of nineteen days celebration, which concludes with three days public festival. Sherpa get time to gather and celebrate this festival with monastic community.  Lamas and Sherpa gather at the monastery for five days for the welfare of the world.  Demons are quelled and the virtuous are rewarded. The monks wear elaborate mask, costumes’ and through a series ritualistic Lama dances, dramatize the triumph of Buddhism over Bon, The main first days of festival involves prayers, second day for colorful lama dancing, they wear brocade gown and wonderfully painted papier-mâché masks. Last day is for some humorous dances and chanting prayers. Hundred of local people and foreign tourist attend the performance. This trek rewards you to see the real and ideal culture of Sherpa people and great Himalayan picturesque views.", "price": "989", "tripDuration": "9", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "kanchenjunga-trekking", "slug2": "kanchenjunga-base-camp-trekking", "trekName": "Kanchenjunga North and South Base Camp Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/View-of-Mount-Kanchenjunga-from-Sandakphu-Ilam-Nepal.jpg", "trekDescription": "Kanchenjunga Base Camp Trek has been marked as best trekking destination in remote part of Nepal by hundreds of hikers in the world. The trek offers insight experience in depth unique local people’s life style, flora and fauna, and mesmerizing panorama by going into the remote mountain ranges of eastern Nepal bordering to India and Tibet. The trek explores the area of Mount Kanchenjunga (8,586m) - the third highest mountain among the fourteen eight thousanders in the world. Visitors can see the variety of scenery from lush, tropical jungle through to rhododendron, chestnut and oak forests and then at higher altitudes into the alpine zone. Trekkers will observe a diversity of Nepalese culture and life-style from Rai and Tibetan Buddhist influenced villages.", "price": "2175", "tripDuration": "25", "tripDifficulty": "Strenuous "},
{"slug0": "nepal-trekking", "slug1": "nepal-festival-tours-and-treks", "slug2": "mustang-tiji-festival-trek", "trekName": "Mustang Tiji Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/tiji-festival-trek-in-upper-mustang.jpg", "trekDescription": ", a three-day ritual known as \"The chasing of the Demons\" and it is centered on the Tiji myth. Tiji tells the story of a deity named Dorje Jono who must battle against his demon father to save the Kingdom of Mustang from destruction. The demon father wreaks havoc on Mustang by creating a water shortage which, in this extremely arid land, is the most precious life-sustaining resource. Dorje Jono eventually defeats the demon and banishes him from the land. This festival falls in the end of May. We, Guide in Himalaya (affiliated with ", "price": "1769", "tripDuration": "14", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-festival-tours-and-treks", "slug2": "yartung-festival-trekking", "trekName": "Yartung Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Yartung-Festival-in-Muktina.jpg", "trekDescription": "This trekking program is developed for those people who look for the chance to observe super Tibetan Buddhist festival in Nepal and magnificent mountain view of Nilgiri and Dhaulagiri in Annapurna. The Yartung festival is celebrated all over Mustang and is especially celebrated in Muktinath during August full moon day every year. It is a three day celebration and is celebrated with horse races, drinking and dancing by local Thakali people. During the three days celebration, we have the King ́s (local king) activities taking place on the first, the lamas and monks on the second and the local people ́s on the third. The most attractive occasion of this festival is the horse race contest by man and woman. In their language, Yartung means the end of summer; Mela means festival or fair; Yartung Mela means a festival to send off summer.", "price": "785", "tripDuration": "7", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "pikey-peak-trek", "trekName": "Pikey Peak Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Pikey-trek.jpg", "trekDescription": "If you are looking for a brief trek within the Mount Everest region close from capital of Nepal, this is often an excellent (less discovered) route. If you are fit and fine or you are in time restriction, we can simply shorten this trek and craft the short itinerary of 5 - 6 days. But, a more well-off 7 days plan permits you for a physical effort while not the strain, and an opportunity to go to variety of Buddhist sites (monasteries, gompas, and stupas).", "price": "489", "tripDuration": "7", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-festival-tours-and-treks", "slug2": "dumji-festival-trek", "trekName": "Dumji Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Junbesi-Monastery.jpg", "trekDescription": "It is celebrated in all the Sherpaa settlements in the month of July. The Sherpas of Kathmandu and Helambu regions participate in dancing on this day. Generally, there are no such major festivals in this month. Being the rainy season, this month is the peak time for harvesting crops.This is a very special festival in the Khumbu area celebrated in the month of July every year. There is much dancing and merry making in addition to the more serious rituals and dances performed by the monks.", "price": "565", "tripDuration": "6", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "tamang-heritage-trail-trekking", "trekName": "Tamang Heritage Trail Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Tatopani-Village-in-Tamang-Heritage.jpg", "trekDescription": "The  ́Tamang Heritage Trail Trek ́ one of the nearest trekking destination from Kathmandu which is developed by the “Tourism for Rural Poverty Alleviation Program, the \"Tamang Heritage Trail\" is newly developed and an off the beaten track experience, which highlights an ancient lifestyle combining it with picturesque scenery and healing baths in natural hot springs. This is an excellent introduction to the trekkers. This area is connected to Tibet and the trails in this region were used by traders from Tibet bartering in salt and for meat chyangra (mountain goat) with foodstuffs from the south. The people of this region are mostly Tibetans who came from Kerung in Tibet across the border and settled in Nepal. In earlier days, the citizenship of Nepal would not be offered to real Tibetans, so they changed their ethnicity to Tamang, which is what they still write till date. The culture and traditions of these people are similar to Tibet just across the border. During Tamang Heritage Trail trek along unbeaten trails and offering a total wilderness experience you will explore traditional Tamang villages, unspoiled and virtually untouched culture, life, crafts and nature. You will receive a warm welcome by the locals rich in their distinct colorful costumes, their houses adorned with beautiful woodcarvings. This region offers a wilderness experience with beautiful landscapes of alpine terrain, flat meadows and rhododendron forests. There are still bears, leopards, red panda and musk deer. During the months of March and April the Rhododendron forests are in full bloom and have many different species of trees, birds and butterflies. ", "price": "443", "tripDuration": "7", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "balthali-village-trek", "trekName": "Balthali Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Namo-Buddha.jpg", "trekDescription": "Short village trek around Kathmandu valley offer delightful holiday, just within an hour drive from Kathmandu. Balthali Village Trek offers traditional and rural Nepal with splendid views of different Himalayan ranges. Nature lovers and bird watchers can spend and enjoy days exploring and discovering some excellent species of wildlife, tradition and civilization untouched by modernity. This \"off beaten location\" has infinite trials leading to many villages of Tamang, Newar and some ethnic tribes area offer several other excellent short hikes and mountain biking experience. You don’t have to be extremely fit to do this small trek just you should have a spirit of 4-5 hours a day  walk is enough to enjoy the tour.", "price": "229", "tripDuration": "3", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "poon-hill-trek-4-days", "trekName": "Poon Hill Trek 4 Days", "trekImage": "https://www.guideinhimalaya.com/uploads/img/view-from-tadapani-in-poon-hill-trek.jpg", "trekDescription": "Poon Hill Trek is the right for those who don’t have much time for longer trek, or don’t think if you are physically ready for taugh and longer trekking? Then Poon Hill Trek is the best option for you. Ghorepani Poon Hill trek provides easy get in for the first day of the tour. On the day of the trekking, you have some long steep uphill stone steps to Ulleri Village from Hile but after walking about two hours from the beginning you will enter into biggest rhododendron forest. You may see different colors of rhododendron flowers if you are trekking in March to May. Once you reach to Deurali which is upper part of Ghorepani you may observe stunning and incomparable view of giant Annapurna. On the second night we stay at Ghorepani, at altitude of 2855 meters. Most trekkers rise before down and hike up to Poon Hill (3210m) for early morning pleasure trek. The spectacular panorama stretches from Dhaulagiri I (8167m), Tukche peak (6920m), Nilgiri (6940m), Annapurna South (7219m), Annapurna I (8091m), Hiunchuli (6441m), Machhapuchhre (6997m) and the Lamjung Himal and Manaslu to Far East. ", "price": "299", "tripDuration": "4", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "chisapani-nagarkot-trek", "trekName": "Chisapani Nagarkot Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/View-from-Chisapani-in-Nagarkot_Trek.jpg", "trekDescription": "Chisapani Nagarkot Trek is a short and sweet trip of 3 days tea house trek around Kathmandu and can be extended to Dhulikhel and Namo Buddha for another 1-2 days. This tour plan is designed for the short time travelers in Nepal who would like to experience the  taste of Nepal. Chisapani Nagarkot Trek starts from Sundarijal after driving 45 minutes from Kathmandu. In the beginning the trail pierces Shivapuri National Park passing through a big watershed that provides 40 percent drinking to Kathmandu Valley. Chisapani Nagarkot Trek offers beautiful nature and village walk experience, natural environment, stunning Himalaya panorama of Manaslu, Ganesh Himal, Langtang Himal, Gaurishankar Himal and even we can spot Mount Everest in far distance. ", "price": "269", "tripDuration": "3", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "3-days-poon-hill-trek-from-pokhara", "trekName": "2 Nights 3 Days Poon Hill Trek from Pokhara", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Poon-Hill-Trek-Photo.jpg", "trekDescription": "This superb short and sweet 3 Days Poon Hill trek offers best of Annapurna trekking experience including nature, villages and mountain vista in low budget cost of USD 265 in group join basis. The main attractions of this 2 nights 3 days Ghorepani Poon Hill Trek is hiking to Poon Hill for stunning view of nearby mountains: Mount Dhaulagiri, Nilgiri, Tukche Peak, Dhampus Peak, Annapurna I, Annapurna south, Fishtail, Manaslu and the one of the largest Rhododendron forest, thickly covered in moss. The Rhododendron blooming season is in spring around March to mid May.", "price": "265", "tripDuration": "3", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "australian-camp-dhampus-village-tour", "trekName": "Australian Camp and Dhampus Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/australain-camp-trek-nepal.jpg", "trekDescription": "Join our fabulous short trek to Australian Camp for 1 night 2 days excellent getaway from daily monotonous life that offers very refreshing hiking in the nature and village experience and walk through the terraced farmland and cultural village of Dhampus, Kande and Pothana. The trip starts after well prepared breakfast in Pokhara, an hour smooth drive from Pokhara takes us to Kande at the altitude of 1700 meter from sea level, the starting point of this short trekking of Australian Camp and Dhampus Village trek. This is an easy village walk and a nice hike of 1 night 2 days for the amazing experience luxury holidays near Pokhara valley. ", "price": "99", "tripDuration": "2", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "ghale-gaun-village-trek", "trekName": "Ghale Gaun Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Ghale-Gaun.jpg", "trekDescription": "Ghale Gaun Village Trekking attracts those travelers and explorers who wish to experience stunning natural beauty mixed with an unspoiled ethnic life style with home stay village tour in an isolated village areas of Nepal then Ghale Gaun Village Trekking is one of the best destinations. The most significant attraction of the region is; exciting rural community, friendly and affectionate people. We can enjoy the majestic view of Mt. Machhapuchhre/6697m Annapurna/8091m, Annapurna II 7939, Annapurna IV (7525m), Lamjung Himal/6932m, Bouddha Himal/6974m, Himalchuli/6747m and many small peaks. Visitors can taste the local gastronomy which is locally produced without using chemical fertilizers. They serve organic food such as grain, vegetable, meat, milk, eggs.", "price": "469", "tripDuration": "6", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "tatopani-ghorepani-village-trekking", "trekName": "Tatopani Ghorepani Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Ghorepani-Tatopani-Trek.jpg", "trekDescription": "There are a number of options for short treks in the foothills to the north of Pokhara. Tatopani Ghorepani Village Trekking trip is one of the most desiring programs intended for those who want to see the Himalayas, to explore the unique cultural, tradition and religion of tribes in Nepal within short period of time, a beautiful panoramic mountain view from the Poon Hill situated at the elevation of 3210m. And the experiences you share with our enthusiastic Nepalese tour crew.", "price": "469", "tripDuration": "7", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "nepal-village-trekking", "slug2": "ganesh-himal-tamang-heritage-trail-trekking", "trekName": "Ganesh Himal Tamang Heritage Trail Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Ganesh-Himal-Tamang-Heritag.jpg", "trekDescription": "Ganesh Himal and Tamang Heritage combined trekking’ offers a deep look at the Tamang culture. This trek is virgin, of the beaten track, wilderness, less touristic and ancient trading route to Kerung in Tibet. Tamang- Helmo and Tibetan culture, beautiful and unique Tamang settlements, marvelous Himalayan views of Ganesh Himal, Sangen Himal, Langtang Lirung, and home-stay are the main features of this trek. The people of the region are Tibetan origin who came to Nepal during 14th century.", "price": "785", "tripDuration": "15", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "ganesh-himal-trekking", "slug2": "ganesh-himal-panorama-trekking", "trekName": "Ganesh Himal Panorama Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/morning-view-from-Pangsang-.jpg", "trekDescription": "Ganesh Himal, a \"Great Himalayan Chain\" a sub-range of the Himalaya located in north-central Nepal, includes; Yangra (Ganesh I), 7,422 m (24,350 ft) highest peak in the range, Ganesh 2nd  7,118m, Salasungo (Ganesh 3rd  7,043, Pabil (Ganesh 4th)  7,104 and  some other peaks lie on the border with Tibet. There are three other peaks over 7000 meters plus some fourteen others over 6000 m in the range. We can observe all the series of Ganesh Himal, Buddha Himal, Manaslu Himal in the west and Langtang Range in the east. The panorama from the trail Singla to Pansang Pass (4050m) is unbelievably mesmerizing and superb. The area is separated by  the Langtang Area; on the east and the the Budhi (Buri) Gandaki valley and the Shyar Khola valley on the west separate it from the Tsum Valley and the  Manaslu Region, The range lies about 70 km north-northwest of Kathmandu.", "price": "840", "tripDuration": "12", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "manaslu-trekking", "slug2": "manaslu-tsum-valley-trekking", "trekName": "Manaslu Trek with Tsum Valley", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Manaslu-and-Tsum-Valley-Trek.jpg", "trekDescription": "Manaslu Trek via Tsum Valley, around mighty 8163 meter high Mount Manaslu and hidden valley of Tsum is unexpectedly popular among wilderness trekking keens. Manaslu region was opened for the trekkers only in 1995 and Tsum was also just released in 2008. Manaslu and Tsum Valley Trek in this geographically extra spectacular and culturally most mesmerizing area, that rewards the trekkers to discover ultimate nature and cultural heritage and experience the mountain life style in Tsum Valley and Manaslu. The residents of upper Bhudi Gandaki, a region known as ‘Nup Ri’ meaning Western Mountain are direct descendants of Tibetan immigrants and they settled here during early 16th century consequently their speech, dress and customs are absolutely similar to Tibetans in the North of Nepal. The Mountain Views in Nup Ri are sensational and iconic that you can find nowhere in the world. The dramatic Larke Pass after visiting Tsum Valley is thrilling life that experience.", "price": "1296", "tripDuration": "19", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "manaslu-trekking", "slug2": "manaslu-circuit-trekking", "trekName": "Manaslu Circuit Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Manaslu-Trek-Photo.jpg", "trekDescription": "The journey of Manaslu Circuit Trek starts from Soti Khola at the altitude of 700 meters from seas level, is a charming village at the bank of Budhi Gandaki river. From lush rice paddies terraced fields with water buffalo and thatched huts, we walk north along the incredible, mountain-capped high route, through sprawling Gurung villages perched on high, terraced hilltops covered in Rhododendron, to reach Kutang, or lower Nubri. Here the ethnically Tibetan inhabitants speak their own dialect, partly Tibetan and partly Gurung, and live a lifestyle that spans Nepal and Tibet.", "price": "859", "tripDuration": "11", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "ganesh-himal-trekking", "slug2": "ganesh-himal-tamang-heritage-trail-trekking", "trekName": "Ganesh Himal Tamang Heritage Trail Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Ganesh-Himal-Tamang-Heritag.jpg", "trekDescription": "Ganesh Himal and Tamang Heritage combined trekking’ offers a deep look at the Tamang culture. This trek is virgin, of the beaten track, wilderness, less touristic and ancient trading route to Kerung in Tibet. Tamang- Helmo and Tibetan culture, beautiful and unique Tamang settlements, marvelous Himalayan views of Ganesh Himal, Sangen Himal, Langtang Lirung, and home-stay are the main features of this trek. The people of the region are Tibetan origin who came to Nepal during 14th century.", "price": "785", "tripDuration": "15", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "manaslu-trekking", "slug2": "tsum-valley-trekking", "trekName": "Tsum Valley Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Festival-in-Tsum-Valley.jpg", "trekDescription": "Tsum Valley Trek takes the visitors to the hidden valley of Tsum meaning “vivid” home to the direct descendant Tibetan people known as Tsumbas, the Tsum Valley is located to the east of Manaslu, on the border with Tibet. This isolated hidden Shangri-La is just opened to trekkers in 2008. It remains relatively untouched, with ancient villages and Tibetan Buddhist monasteries waiting to be explored. Each day you will walk between 5–8 hours, with the high point of the trek being 4,000m above the largest of the monasteries in the valley, Mu Gompa. You will be accommodated in lodges and traditional ‘home stays’ on this trek, rather than in tents. As the Tsum Valley is much undeveloped but with its unique culture and most hospitable people offers us friendly welcome in traditional way to their home can be somewhat rudimentary and you can expect to eat similar food to the locals (Dal Bhat, Chapatis, noodle soup). If you are not prepared to  ́rough it ́ a little bit, then this trek is probably not the one for you!", "price": "789", "tripDuration": "13", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "manaslu-trekking", "slug2": "rupina-la-pass-trek", "trekName": "Rupina La Pass Trek in Gorkha", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Rupina-La-Pass-Trek.jpg", "trekDescription": "Rupina La Pass Trek combined with Tsum Valley begins from the Kathmandu and take you to Gorkha, associated with ancient  town of Gorkha. From here, you reach Barpak Village, wherever the current residents area unit the Gurung community. you'll then bear Gai Kharka, Rubina la Phedi and spending the Rubina la Pass at associate elevation of four,720 meters. you'll end up during a peaceful surroundings with jumbo peaks keeping watchful eyes over you. savouring the enthralling views, you start the descent. you'll then cross the Budi Gandaki watercourse and reach Tsum natural depression. Further, you'll descend towards Jagat and cross Machha Khola to succeed in Arughat Bazaar. you'll get to move with the locals here. From here, you'll take a non-public holidaymaker vehicle that may take you back to Kathmandu, and your trip ends here. The path are tough and strenuous on several sections. This trek can lead you to the region wherever you'll not see any single human settlements for continuous five-six days. The trek may be a glorious chance to witness the mountain chain with the inhabiting floral and faunal abundance. in addition, the made cultural heritage and heart-warming welcome build this trek a must-go-to. the most effective times to travel on this trek is from March to could and Sep to Oct. ", "price": "1985", "tripDuration": "18", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "helambu-circuit-trekking", "trekName": "Helambu Circuit Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Helambu-Trekking-Nepal.jpg", "trekDescription": "Main Highlights of Helambu Trek: Excellent views of mountains that including the Langtang Range, Dorje Lakpa, Gauri Shankar, Dom Blanc, Ganesh Himal, Manaslu and even Everest, Yolmo Culture, Interesting Nepal Villages en route, Brahmins, Tamangs and Sherpas tribes of Nepal,  Thanka painting, Buddhist Monasteries, religious monuments, Sacred Heritages and Pilgrimage Sites, Guru Rimpoche and Buddhist Saint Milarepa Meditated Caves, Beautiful flora and fauna etc. ", "price": "499", "tripDuration": "8", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "tamang-heritage-and-langtang-valley-trek", "trekName": "Tamang Heritage and Langtang Valley Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/tamang-heriatge-and-langtang-trek.jpg", "trekDescription": "To explore the untouched and newly discovered trekking trail in Tamang Heritage and Langtang Valley Trek in the area of friendly, hospitable Tamang people and to enjoy classic Langtang Valley combined with Tamang Culture trek in the Langtang Region offers an off the beaten track experience, things to see an ancient lifestyle combining it with scenic view and healing baths in natural hot springs (Tatopani). This exceptional area is thrilling, culturally rich and traditionally fascinating close to Tibetan border, the local Tamang people are some of the warmest, sincere and most welcoming people in Nepal. Within easy entrance from Kathmandu ascend the road north towards the Tibetan borderlands and enjoy a relatively gentle circuit trek through charming villages, terraced fields, and peaceful valleys where only the most discerning trekkers go. En route, we enjoy panoramic mountain views of the nearby peaks and soak in the natural hot springs at Tatopani. Continuing north towards Tibet we soak up the heritage and appreciate a local fort, monastery and exquisite local architecture of the Tamang homes. As we near the end of the trek we enjoy a home stay experience in Briddim and have a full day to relax and discover more about the local traditions of this wonderful region.", "price": "621", "tripDuration": "11", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "tamang-heritage-trail-trekking", "trekName": "Tamang Heritage Trail Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Tatopani-Village-in-Tamang-Heritage.jpg", "trekDescription": "The  ́Tamang Heritage Trail Trek ́ one of the nearest trekking destination from Kathmandu which is developed by the “Tourism for Rural Poverty Alleviation Program, the \"Tamang Heritage Trail\" is newly developed and an off the beaten track experience, which highlights an ancient lifestyle combining it with picturesque scenery and healing baths in natural hot springs. This is an excellent introduction to the trekkers. This area is connected to Tibet and the trails in this region were used by traders from Tibet bartering in salt and for meat chyangra (mountain goat) with foodstuffs from the south. The people of this region are mostly Tibetans who came from Kerung in Tibet across the border and settled in Nepal. In earlier days, the citizenship of Nepal would not be offered to real Tibetans, so they changed their ethnicity to Tamang, which is what they still write till date. The culture and traditions of these people are similar to Tibet just across the border. During Tamang Heritage Trail trek along unbeaten trails and offering a total wilderness experience you will explore traditional Tamang villages, unspoiled and virtually untouched culture, life, crafts and nature. You will receive a warm welcome by the locals rich in their distinct colorful costumes, their houses adorned with beautiful woodcarvings. This region offers a wilderness experience with beautiful landscapes of alpine terrain, flat meadows and rhododendron forests. There are still bears, leopards, red panda and musk deer. During the months of March and April the Rhododendron forests are in full bloom and have many different species of trees, birds and butterflies. ", "price": "443", "tripDuration": "7", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "classic-langtang-valley-trekking", "trekName": "Langtang Valley Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/langtang-valley-trek.jpg", "trekDescription": " The high and isolated Langtang Valley is inhabited by welcoming and culturally rich Tamang people. Their religious practices, language and dress are very similar to those of Tibet than to traditions of their cousins in the middle hills. The area is famous for its pleasant local, unique tradition flavor, Buddhist monasteries and monuments along the way and spectacular mountain view. This charming Langtang valley trek follows the river upstream through forest of pine, bamboo and rhododendron, uphill through pastures to arrive at the alpine meadows of Kyanjin Gompa where you will get exceptional mountain view just a stone’s throw from the Tibetan Boarder. ", "price": "499", "tripDuration": "8", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "langtang-helambu-trekking", "trekName": "Langtang Helambu Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Langtang-Trek.jpg", "trekDescription": "Langtang Gosaikunda Helambu Trek starts with a day bus or jeep ride to Syabrubesi, the journey begins entering to the attractive Langtang Valley; famous for the region’s beautiful destination aptly entitled the valley of glacier. Here the mountain valley is brilliant. On either side of valley, mountains rise, towering high in to the sky. The valley offers pine forest, slow moving rivers and swift mountain streams, rugged rock and snow- capped peaks, grassy downs and meadows strewn with daisies and wild Primus. In the upper part of valley there are snow bridges spanning angry torrents, high passes enveloped in mist, tiny lake with iceberg floating on them and water of crystalline brightness. There are also high mountains of slide ice. You have a stunning view of Langtang Lirung, Langshisha Ri, Yala peak, Gangchempo, Ganja-La range, Dorje Lakpa many other white peaks from Tesrko Ri which one of the best demanding day excursion from Kyanjin Gompa.", "price": "950", "tripDuration": "15", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "langtang-gosaikunda-trekking", "trekName": "Langtang Gosaikunda Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Langtang-Gosaikunda-Trek.jpg", "trekDescription": "Langtang Gosainkunda Trek to the high and isolated Langtang Valley via thrilling Lauribina La Pass (4610m) then to magical holy Gosainkunda Lake and down to Syabru village inhabited by welcoming and culturally rich Tamang people, their religious practices, language and dress are very similar to those of Tibet than to traditions of their cousins in the middle hills. The area is famous for its pleasant local, unique tradition, Buddhist monasteries and monuments along the way and spectacular Mountain View. The trek first goes to charming Langtang valley following the river upstream through forest of pine, bamboo and rhododendron, uphill through pastures to arrive at the alpine meadows of Kyanjin Gompa where you will get exceptional Mountain View just a stone’s throw from the Tibetan Boarder.", "price": "743", "tripDuration": "12", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "langtang-region-trekking", "slug2": "langtang-ganjala-pass-trekking", "trekName": "Langtang Ganjala Pass Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Langtang-Ganjala-Pass-Trek.jpg", "trekDescription": "An adventurous and challenging Langtang Ganjala Pass Trekking ascends from 1470m, Syabrubesi, a day drive from Kathmandu then the trail follows Classic Langtang Valley Trek, until reaching Kyanjin Gompa through Lama Hotel, Ghoda Tabela, culturally and traditionally rich Lantang Village.  This trek is less trekked trail of the region because of its difficulty, requires some basic mountaineering knowledge and climbing equipment but offers an opportunity to explore Tibetan style Tamang Villages, high alpine pasture, spectacular close-up views of surrounding peaks and glaciers of Langtang Lirung (7246m), Kimshung (6781m), Langshisha Ri (6370m) with breath stopping views of Ganesh Himal, Dorje Lakpa, Yala peak, Naya kanga, Gaurishanker etc. is an entirely wilderness adventure experience and thrilling trekking for body and mind experience. After an exciting explore or acclimatization day in Kyanjin Gompa we trek about 3-4 hours to Ngegang crossing Lantang Khola which is a last good place to camp then set up for awesome Ganjala Pass. There are some yak and goat herder’s places and during the rainy season the carry bamboo mat to provide roof for huts. The trek from Ngegang to Keldang is hardest part of this trip via 5106m high Ganjala pass. The view from the top of pass is Lantang Lirung, Shishapangma (8013m) in Tibet are outstanding. ", "price": "1205", "tripDuration": "12", "tripDifficulty": "Strenuous "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "pikey-peak-trek", "trekName": "Pikey Peak Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Pikey-trek.jpg", "trekDescription": "If you are looking for a brief trek within the Mount Everest region close from capital of Nepal, this is often an excellent (less discovered) route. If you are fit and fine or you are in time restriction, we can simply shorten this trek and craft the short itinerary of 5 - 6 days. But, a more well-off 7 days plan permits you for a physical effort while not the strain, and an opportunity to go to variety of Buddhist sites (monasteries, gompas, and stupas).", "price": "489", "tripDuration": "7", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "dudh-kunda-pikey-peak-trek", "trekName": "Dudh Kunda Trek with Pikey Peak", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Pikey_Peak_and_Numbur_Base_Camp_Trek.jpg", "trekDescription": "Looking for lesser known and rural areas for wilderness trekking in Nepal? Yes Pikey Peak Trek with Numbur Himal Base Camp trek fulfill your dream that offers less popular trek with package of diversity including Sherpa people, village experiences, local tradition, religious moment and mountain environment during the trek. The pikey peak and base camp of Numburchuili Himal in the lower Solukhmubu region covers the area starting at Dhap and ending at Salleri in Solukhumbu district of Nepal. The Pikey Peak is one of the tallest hills of lower Solukhumbu region of 4065 meters which is one of the attractive viewpoints for Numburchuli Himal and other Himalayas of Everest region. ", "price": "929", "tripDuration": "12", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "mani-rimdu-festival-trekking", "trekName": "Mani Rimdu Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/monks-performing-fire-puja-in-mani-rimdu-festival.jpg", "trekDescription": "Mani Rimdu Festival is celebrated at Tengboche, Thame and Chiwong Monasteries of Solukhumbu Nepal. This is a sacred ceremonies and series of events of empowerment. It is a sequence of nineteen days celebration, which concludes with three days public festival. Sherpa get time to gather and celebrate this festival with monastic community.  Lamas and Sherpa gather at the monastery for five days for the welfare of the world.  Demons are quelled and the virtuous are rewarded. The monks wear elaborate mask, costumes’ and through a series ritualistic Lama dances, dramatize the triumph of Buddhism over Bon, The main first days of festival involves prayers, second day for colorful lama dancing, they wear brocade gown and wonderfully painted papier-mâché masks. Last day is for some humorous dances and chanting prayers. Hundred of local people and foreign tourist attend the performance. This trek rewards you to see the real and ideal culture of Sherpa people and great Himalayan picturesque views.", "price": "989", "tripDuration": "9", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "everest-base-camp-trekking", "trekName": "Everest Base Camp Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Lukla-Airport.jpg", "trekDescription": "Everest Base Camp is premium trekking destination in the world and most desired dream hiking goal among trekkers. Our cautiously designed 17 days itinerary allow you for proper acclimatization process to get real close –up to see Sagarmatha literally meaning “The Head of Earth or Sea” internationally known as Mount Everest. To reach this part of the Himalaya Base Camp within a short period of time, we have devised this short trekking tour itinerary to Hike to Everest Base Camp which runs directly starts and ends at Lukla. The trek to Everest Base Camp also called EBC trek in short form, a very world famous mountain trek, starts after 35 minutes picturesque flight from Kathmandu to Lukla. We follow the Dudh Kosi River valley which climbs up to the Sherpa capital of Namche, a busy market that is a junction for all the trekkers, the local Sherpa and Expeditions en route to the mighty Mt. Everest. All along this part of the trail, villages are interspersed with magnificent forests of rhododendron, magnolia and giant firs. In both the early autumn and late spring, the flowers on this portion of the trek make it the kind of walk you will remember for a long, long time.", "price": "1089", "tripDuration": "12", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "everest-panorama-trekking", "trekName": "Everest Panorama Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/everest-panorama-trek-photo.jpg", "trekDescription": "Everest Panorama Trek also known as Everest View Trek is an easy short trek tailored for those trekkers who desire to see Mt. Everest but they do not have sufficient time to go all the way to Everest Base Camp or restricted to go there by other reasons. This small trek to Everest region offers you to see grandeur view of Mount Everest (8848m), Region’s most beautiful mountain Amadablum, Lhotse, Nuptse, peak 38, Thamserku, Khantega, Kwande peak, and other many small peaks. In this trek tour is not only about the mountain views, but also a great chance to experience and to explore stunning Sherpa villages and have a close look at their fascinating Buddhist religion, culture and tradition etc.", "price": "878", "tripDuration": "8", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "classic-jiri-everest-base-camp-trekking", "trekName": "Classic Jiri Everest Base Camp Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Sunset-on-Lhotse.jpg", "trekDescription": "Most people take Lukla flight from Kathmandu to start the Everest Base Camp trek but you will be physically much fitter and better acclimatized if you start your trek from Jiri, which is 8-9 hours drive from Kathmandu or either further drive to Shivalaya then start the trek. The Classic Jiri Everest Base Camp trek goes through the beautiful middle hills countryside, villages, Buddhist monasteries, monuments and beauty fauna. This route to Khumbu area is wonderfully free from crowd and no stress to book a ticket to Lukla offering an approach into the village life and culture of the famous Sherpa people combined with a journey into some of the most magnificent scenery in the world.", "price": "979", "tripDuration": "18", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "dumji-festival-trek", "trekName": "Dumji Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Junbesi-Monastery.jpg", "trekDescription": "It is celebrated in all the Sherpaa settlements in the month of July. The Sherpas of Kathmandu and Helambu regions participate in dancing on this day. Generally, there are no such major festivals in this month. Being the rainy season, this month is the peak time for harvesting crops.This is a very special festival in the Khumbu area celebrated in the month of July every year. There is much dancing and merry making in addition to the more serious rituals and dances performed by the monks.", "price": "565", "tripDuration": "6", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "gokyo-chola-pass-trek", "trekName": "Gokyo Chola Pass Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Chola-Pass-Trek-Photo.jpg", "trekDescription": "Gokyo Chola Pass Trek is one of the most fashionable treks in the Everest region. This trek links Everest Base Camp and Gokyo Valley with adventurous Chola Pass crossing over 5417 meter mountain pass. It covers not only Everest Base Camp but also Lukla, Namche Bazar, Tengboche as whole Solukhumbu (Distric) and some nice peaks (like Gokyo Ri or Kala Patthar). EBC and Gokyo via Cho La Pass itinerary is one of Nepal most renowned trek as well as one of most severe in the Himalaya mountains and Sherpa country. One of the goal of this expedition is the Everest Base Camp, an elevation of 5364 meter and Kala Patthar, 5545m. When we climb Kala Patthar we can also see the southern face of Mt. Pumo Ri which is 7168m.", "price": "1005", "tripDuration": "16", "tripDifficulty": "Strenuous "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "everest-gokyo-trek", "trekName": "Everest Gokyo Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/View-from-Gokyo-Ri.jpg", "trekDescription": "Gokyo Valley Trek, a short trip to Everest Region leads you to the beautiful and charming hamlet Gokyo Valley which is one of the highest settlements in the Himalaya of Nepal, is a very popular trekking route. The series of emerald green lakes along the Ngozumpa Glacier, thrilling hike up to Gokyo peaks and heart stopping view from there is unique experience. The route itself ends at Gokyo Ri, and trekkers typically turn around at this point and retrace their steps back to the trailhead. There are two alternative routes, one that leads to main Everest Base Camp trail to east over the Chola Pass (5420m, 17782 ft.), and other one Renjo La Pass (5417 m, 17767ft) to the west of Gokyo valley leads to cultural Thame Village ( see Everest 3 Passes Trek). ", "price": "1175", "tripDuration": "12", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "everest-trekking", "slug2": "everest-three-high-passes-trekking", "trekName": "Everest Three High Passes Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Everest-Base-Camp-Tre.jpg", "trekDescription": "This ultimate Everest Three High Passes Trek is for those who seek for more wild and challenging holidays experience as it is more demanding and the longer route crossing through three high passes that are not on the regular Everest trail. These are the Kongma La (5,535m), Cho La (5,420m) and the Renjo La (5,417m). You will also climb three hikng peaks; Gokyo Ri (5,360m) and Kala Pattar (5,54m) offer superb views of Everest, whilst Chukkung Ri (5,550m) is a lesser-known summit, tucked under the imposing Lhotse-Nuptse wall. This westerly approach to Everest provides amazing vistas of the world ́s highest mountain and should be considered in particular, by the keen photographer or by those who want a tougher trek. ", "price": "1545", "tripDuration": "21", "tripDifficulty": "Strenuous "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "poon-hill-trek-4-days", "trekName": "Poon Hill Trek 4 Days", "trekImage": "https://www.guideinhimalaya.com/uploads/img/view-from-tadapani-in-poon-hill-trek.jpg", "trekDescription": "Poon Hill Trek is the right for those who don’t have much time for longer trek, or don’t think if you are physically ready for taugh and longer trekking? Then Poon Hill Trek is the best option for you. Ghorepani Poon Hill trek provides easy get in for the first day of the tour. On the day of the trekking, you have some long steep uphill stone steps to Ulleri Village from Hile but after walking about two hours from the beginning you will enter into biggest rhododendron forest. You may see different colors of rhododendron flowers if you are trekking in March to May. Once you reach to Deurali which is upper part of Ghorepani you may observe stunning and incomparable view of giant Annapurna. On the second night we stay at Ghorepani, at altitude of 2855 meters. Most trekkers rise before down and hike up to Poon Hill (3210m) for early morning pleasure trek. The spectacular panorama stretches from Dhaulagiri I (8167m), Tukche peak (6920m), Nilgiri (6940m), Annapurna South (7219m), Annapurna I (8091m), Hiunchuli (6441m), Machhapuchhre (6997m) and the Lamjung Himal and Manaslu to Far East. ", "price": "299", "tripDuration": "4", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "mardi-himal-trek-5-days", "trekName": "Mardi Himal Trek 4 Nights 5 Days", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Mardi-Trek-5-days.jpg", "trekDescription": "Mardi Himal Trek; a lesser known trekking route a decade ago now growing it’s popularity rapidly in recent years. This trekking draws the hundreds of trekking passionate every day in peak seasons that offer outstanding view of Annapurna range including Mardi Himal itself, Machhapuchhree, Annapurna South, Hiuchuli, Barashikhar, Annapurna I, Gangapurna and several other towering peaks.", "price": "359", "tripDuration": "5", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "nar-phu-valley-trekking", "trekName": "Nar Phu Valley Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Nar-Village-in-Nar-Phu-Vally.jpg", "trekDescription": "Nar Phu Valley Trek, located in the isolated corner of restricted part of Annapurna between Damodar Kunda and Annapurna Circuit part one. The area is untouched of modernity and where people adopting Tibetan culture since many centuries back. This off the beaten track trek from Annapurna offers real taste of Himalayan life style, culture, tradition, old Buddhist monasteries, and explore an untouched valley which offers an incredible view of majestic mountains in the high lands along with beautiful medieval and ancient remote villages such as Nar and Phu, amazing rock formations, glaciers, narrow canyons, lovely and pleasant forests, unique Himalayan and Tibetan culture, life styles, and high altitude settlements.", "price": "1173", "tripDuration": "16", "tripDifficulty": "Strenuous "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "mardi-himal-trek", "trekName": "Mardi Himal Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Mardi-Himal-Trek-Photo.jpg", "trekDescription": "Fantastic Mardi Himal Trek is located just east of one of the most legendary trekking destination of Nepal, the Annapurna Base Camp trek. Mardi Himal trek is an unseen gem yet. Few trekkers make their way to the Mardi Himal Base Camp outstandingly positioned at the base of Mardi Himal and the Annapurna region ́s most iconic mount Machapuchhre literally meaning \"Fish tail\". The trail goes along small winding paths, through enchanted rhododendron forests until you climb out of the forest at an elevation around 3,300 meter. The landscape changes quite abruptly into a rugged high mountain landscape, with amazing views of Mardi Himal, Machapuchre, Annapurna South and Hiunchuli.", "price": "399", "tripDuration": "6", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "upper-mustang-trekking", "trekName": "Upper Mustang Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Chhortens-in-Tenge-in-Upper-Mustang.jpg", "trekDescription": "Our wonderful Upper Mustang trek starts from Jomsom after taking a scenic flight from Pokhara, leading you to the hidden Shangri-La of the ancient Buddhist kingdom of Mustang, also called Lo.  Lo used to be part of the Tibetan empire, and is therefore closely connected to Tibet.  Tibetan Buddhism is still being practiced in a very pure form and villages are built in Tibetan style, with white washed houses with firewood tucked on the roofs.Until recently you could only come to Upper Mustang with a fully organized camping trek. However, nowadays some villagers have opened up small guesthouses and you can stay in a guesthouse in each overnight place. While staying there, you are welcome to sit with them in the kitchen. In Tibetan culture, the kitchen is the center of the house, and built like a kind of living room. So there is no better way to learn a bit about the daily life than spending time in the kitchen!", "price": "1779", "tripDuration": "15", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "annapurna-base-camp-trekking", "trekName": "Annapurna Base Camp Trek ", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Annapurna-Base-Camp-Trek-Photo.jpg", "trekDescription": "Annapurna Base Camp Trek probably the best legendary and classical treks in the world offers breathe stopping Mountain View, give opportunity to experience the typical Nepali village, local people and their way of living traditional life in Himalaya of Nepal. The Annapurna Base Camp route goes passing through spectacular and tranquil landscapes, charming Gurung and Magar villages, lush green Rhododendron, bamboo and alpine forests to the trip’s last and final destination, Annapurna Base Camp at the height of 4130m (13546ft.)", "price": "499", "tripDuration": "7", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "annapurna-circuit-trekking", "trekName": "Annapurna Circuit Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/ice-lake-and-annapurna-III.jpg", "trekDescription": "The classic ", "price": "893", "tripDuration": "14", "tripDifficulty": "Challenging "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "australian-camp-dhampus-village-tour", "trekName": "Australian Camp and Dhampus Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/australain-camp-trek-nepal.jpg", "trekDescription": "Join our fabulous short trek to Australian Camp for 1 night 2 days excellent getaway from daily monotonous life that offers very refreshing hiking in the nature and village experience and walk through the terraced farmland and cultural village of Dhampus, Kande and Pothana. The trip starts after well prepared breakfast in Pokhara, an hour smooth drive from Pokhara takes us to Kande at the altitude of 1700 meter from sea level, the starting point of this short trekking of Australian Camp and Dhampus Village trek. This is an easy village walk and a nice hike of 1 night 2 days for the amazing experience luxury holidays near Pokhara valley. ", "price": "99", "tripDuration": "2", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "mustang-tiji-festival-trek", "trekName": "Mustang Tiji Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/tiji-festival-trek-in-upper-mustang.jpg", "trekDescription": ", a three-day ritual known as \"The chasing of the Demons\" and it is centered on the Tiji myth. Tiji tells the story of a deity named Dorje Jono who must battle against his demon father to save the Kingdom of Mustang from destruction. The demon father wreaks havoc on Mustang by creating a water shortage which, in this extremely arid land, is the most precious life-sustaining resource. Dorje Jono eventually defeats the demon and banishes him from the land. This festival falls in the end of May. We, Guide in Himalaya (affiliated with ", "price": "1769", "tripDuration": "14", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "yartung-festival-trekking", "trekName": "Yartung Festival Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Yartung-Festival-in-Muktina.jpg", "trekDescription": "This trekking program is developed for those people who look for the chance to observe super Tibetan Buddhist festival in Nepal and magnificent mountain view of Nilgiri and Dhaulagiri in Annapurna. The Yartung festival is celebrated all over Mustang and is especially celebrated in Muktinath during August full moon day every year. It is a three day celebration and is celebrated with horse races, drinking and dancing by local Thakali people. During the three days celebration, we have the King ́s (local king) activities taking place on the first, the lamas and monks on the second and the local people ́s on the third. The most attractive occasion of this festival is the horse race contest by man and woman. In their language, Yartung means the end of summer; Mela means festival or fair; Yartung Mela means a festival to send off summer.", "price": "785", "tripDuration": "7", "tripDifficulty": "Easy "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "annapurna-off-the-beaten-trail-trek", "trekName": "Annapurna off the beaten trail trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Mulde-View-Point-Trek.jpg", "trekDescription": "Most of the traditional major trekking trail in Annapurna are now trodden with road building. Famous Ghorepani Trek will be soon accessed by road in next couple of years as the road structure to Ulleri from Nayapul has already shortened the trail that have been world famous classic hiking route since last three decades. We have been seeking and doing some potential new path research and found some of the best off the beaten hiking trail. Beside the Mardi Himal we propose virgin and very less traveled trail that is combined with Famous Ghorepani Trek with off the beaten Khopra Danda (Ridge) Trek and excursion to holy Khayer Lake and ending the journey at Australian Camp near Pokhara. ", "price": "749", "tripDuration": "12", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "tatopani-ghorepani-village-trekking", "trekName": "Tatopani Ghorepani Village Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Ghorepani-Tatopani-Trek.jpg", "trekDescription": "There are a number of options for short treks in the foothills to the north of Pokhara. Tatopani Ghorepani Village Trekking trip is one of the most desiring programs intended for those who want to see the Himalayas, to explore the unique cultural, tradition and religion of tribes in Nepal within short period of time, a beautiful panoramic mountain view from the Poon Hill situated at the elevation of 3210m. And the experiences you share with our enthusiastic Nepalese tour crew.", "price": "469", "tripDuration": "7", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "nagi-narchyang-trek", "trekName": "Nagi Narchyang Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/View-from-Mohare-Danda.jpg", "trekDescription": "Trek to Annapurna region has remained one of the most popular activities for trekkers across the globe for the past many decades. But the trail is generally shortening with the advent of motorable roads and other physical infrastructures. It is because of this fact new trails are being identified, explored and promoted so Nagi-Narchyang Trek is one of newly discovered trekking route expected to offer something new to the trekkers. Natural beauty, rich culture, tradition and warm hospitality of local people encourage the trekkers to visit the area again and again. Here, we have provided guideline itinerary of the trip and we, Guide in Himalaya operates great trekking to Nagi, Khopra Hill, Narchyang Village and trip finally ends to Tatopani at the bank of Kali Gandaki River, there we can enjoy the relaxing natural hot spring bathe and get chilled with our trekking companion.", "price": "709", "tripDuration": "11", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "khair-lake-trekking", "trekName": "Khair or Khayer Lake Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Khayer-Lake-Trek.jpg", "trekDescription": "Khayer Lake Trek is newly discovered alternative trekking trail in Annapurna region situated between classic Annapurna Base Camp and Jomsom trekking trail. It is a newly promoted beautiful Trekking route with mix culture of Gurung and Magar people and exceptional mountain views over the many Himalayas including Mt. Dhaulagiri, Annapurna and Nilgiri from Khopra Ridge and Poon Hill.", "price": "659", "tripDuration": "10", "tripDifficulty": "Medium Hard "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "annapurna-sanctuary-trekking", "trekName": "Annapurna Sanctuary Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/annapurna-sanctuary-trek-photo.jpg", "trekDescription": "This 11 Days Annapurna Sanctuary Trek into the heart of Annapurna Himalaya is intended to fulfill the dream of many people to experience the significant mountain holiday at the base of the world ́s famous Annapurna Himal 8091m, the region’s most beautiful peak Machhapuchhre (6997m), Annapurna South, Gangapurna and Hiuchuli etc. in the region. The place is high glacial basin lying forty kilometers directly north of Pokhara. This oval-shaped plateau sits at an elevation of over 4130 meters, and is enclosed by a ring of mountains, the Annapurna range, most of which are above 7000 meters. With the only access a narrow pass between the peaks of Hiunchuli and Machhapuchhre, from where Modi Khola River run-off glaciers drain into, the Sanctuary was not penetrated by outsiders until 1956. Because of high mountains on all sides, the Annapurna Sanctuary receives only 7 hours of sunlight a day at the height of summer. The unique combination of heights and depths in the Annapurna Sanctuary give rise to an astonishing diversity of ecosystems. The south-facing slope are “covered in dense tropical jungles of rhododendron and bamboo”, while the north-facing slopes, in the rain shadow, have “a drier colder weather similar to that of the near-by Tibetan Plateau.”", "price": "623", "tripDuration": "9", "tripDifficulty": "Moderate "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "extreme-saribung-trekking-and-peak-climbing", "trekName": "Extreme Saribung Trekking and Peak Climbing", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Saribung-Pass-Trek-Traverse.jpg", "trekDescription": "This Extreme Saribung Trekking and Peak Climbing is newly discovered trekking route in 2006. It is challenging and very popular trekking trail with beaten track and demanding pass. Saribung is situated in isolated part of Mustang region of Damodar Himal, close to the border of (Tibet). The trail is rugged, cutting high into cliff sides and passes villages that have changed little over the centuries. Saribung Trek can be done in anti-clockwise for which the trek start from Nar-Phu  “a hidden valley” and then ascend to Saribung pass and enter in the Mustang \" known as little Tibet in Nepal\" and down to Jomsom or clockwise for which the trek start from Jomsom and follow Upper Mustang trail and descend to Nar-Phu valley and Besisahar to end. ", "price": "4350", "tripDuration": "21", "tripDifficulty": "Challenging "},
{"slug0": "nepal-trekking", "slug1": "annapurna-trekking", "slug2": "jomsom-muktinath-trekking", "trekName": "Jomsom Muktinath Trek", "trekImage": "https://www.guideinhimalaya.com/uploads/img/Jomsom-Muktinath-Trek.jpg", "trekDescription": "Trekking to Jomsom – Muktinath can be started from Pokhara or fly to Jomsom and trek to Muktinath then walk down to Pokhara or fly out from Jomsom; either one is possible. Muktinath is one of the most important pilgrimage sites for both Hindus and Buddhists and you encounter ascetic sadhus carring trident and more than a blanket on the way. We see people selling saligram along the way to Kali Gandaki, a black stone that, when broken opens reveals the fossilized remains of prehistoric ammonites that lived here more than 140 million years ago,  ", "price": "725", "tripDuration": "12", "tripDifficulty": "Moderate "}
]